# Ultralytics YOLO 🚀, AGPL-3.0 license
# Fused RT-DETR model with CSP-PMSFA backbone and HyperCompute-MFM head (fixed tensor size mismatch)

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# Backbone from rtdetr-CSP-PMSFA.yaml
backbone:
  # [from, repeats, module, args] [宽×高×通道数]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 [320×320×64] (640/2=320, 卷积核3×3步长2降采样)
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 [160×160×128] (320/2=160, 通道数升为128)
  - [-1, 1, CSP_PMSFA, [128]]  # 2 [160×160×128] (CSP结构保持尺寸和通道数)
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 [80×80×256] (160/2=80, 通道数升为256)
  - [-1, 1, CSP_PMSFA, [256]]  # 4 [80×80×256] (保持尺寸和通道数)
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16 [40×40×384] (80/2=40, 通道数升为384)
  - [-1, 1, CSP_PMSFA, [384]]  # 6 [40×40×384] (保持尺寸和通道数)
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32 [20×20×384] (40/2=20, 通道数保持384)
  - [-1, 3, CSP_PMSFA, [384]]  # 8 [20×20×384] (多次CSP结构保持尺寸和通道数)


head:
  # [from, repeats, module, args] [宽×高×通道数]
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2 [20×20×256] (1×1卷积降通道至256，尺寸不变)
  - [-1, 1, TransformerEncoderLayer_Pola_FMFFN, [1024, 8]] # 10 [20×20×1024] (AIFI模块升通道至1024，尺寸不变)
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0 [20×20×256] (1×1卷积降通道至256，尺寸不变)

  # Semantic Collecting
  - [2, 1, nn.AvgPool2d, [4, 4, 0]] # 12 [20×20×128] (160/8=20，池化后尺寸与Y5对齐，通道保持128)
  - [-1, 1, Conv, [64, 1, 1]] #13，变成40×40×64

  - [4, 1, nn.AvgPool2d, [2, 2, 0]] # 14 ,[20×20×256] (80/4=20，池化后尺寸与Y5对齐，通道保持256)
  - [-1, 1, Conv, [64, 1, 1]] #15，变成40×40×64

  - [5, 1, Conv, [64, 1, 1]] #16，变成40×40×64,疑似有问题，后边无连接
  - [6, 1, Conv, [64, 1, 1]] #17，变成40×40×64
  - [11, 1, nn.Upsample, [None, 2, 'nearest']] # 18 [40×40×1024] (20×2=40，上采样放大2倍)
  - [[13, 14, 15, 17, 18], 1, MFM, [256]]  # cat 19 [20×20×256] (多特征融合后通道统一为256，尺寸取最小20×20)

  # Hypergraph Computation
  - [-1, 1, Conv, [256, 1, 1]] # 20 [20×20×256] (1×1卷积保持通道和尺寸)
  - [-1, 1, HyperComputeModule, [256, 10]] # 21 [20×20×256] (超图计算保持尺寸和通道)
  - [-1, 3, MANet, [256, True, 2, 3]] # 22 [20×20×256] (MANet结构保持尺寸和通道)

  # Semantic Collecting
  - [-1, 1, nn.AvgPool2d, [2, 2, 0]] # 23 [10×10×256] (20/2=10，池化降采样)
  - [[-1, 11], 1, MFM, [256]]  # cat 24 [10×10×256] (融合后通道统一为256，尺寸取最小10×10)
  - [-1, 1, Conv, [1024, 1, 1]] # 25 P5 [10×10×1024] (1×1卷积升通道至1024，尺寸不变)

  - [17, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 26 input_proj.1 [40×40×256] (1×1卷积降通道至256，尺寸不变)
  - [[22, -1], 1, MFM, [256]] # 27 [40×40×256] (融合后通道统一为256，尺寸取40×40)
  - [-1, 3, RepC3, [256, 0.5]]  # 28, fpn_blocks.0 [40×40×256] (RepC3保持尺寸和通道)
  - [-1, 1, Conv, [256, 1, 1]]   # 29, Y4, lateral_convs.1 [40×40×256] (1×1卷积保持通道和尺寸)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 30 [80×80×256] (40×2=80，上采样放大2倍)
  - [4, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 31 input_proj.0 [40×40×256] (1×1卷积降通道至256，尺寸不变)
  - [[-2, -1], 1, MFM, [256]]  # 32 cat backbone P4 [80×80×256] (融合后通道统一为256，尺寸取80×80)
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (33), fpn_blocks.1 [80×80×256] (RepC3保持尺寸和通道)

  - [-1, 1, Conv, [256, 3, 2]]   # 34, downsample_convs.0 [40×40×256] (80/2=40，3×3步长2降采样)
  - [[-1, 29], 1, MFM, [256]]  # 35 cat Y4 [40×40×256] (融合后通道统一为256，尺寸取40×40)
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (36), pan_blocks.0 [40×40×256] (RepC3保持尺寸和通道)

  - [-1, 1, Conv, [256, 3, 2]]   # 37, downsample_convs.1 [20×20×256] (40/2=20，3×3步长2降采样)
  - [[-1, 25], 1, MFM, [256]]  # 38 cat Y5 [20×20×256] (融合后通道统一为256，尺寸取20×20)
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (39), pan_blocks.1 [20×20×256] (RepC3保持尺寸和通道)

  - [[33, 36, 39], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5) [300×4+80×3] (输出300个检测框，含4个坐标+80个类别概率)